pkwasniok/avr-db-template/lib/atpack/edc/AVR16DU28.PIC
        <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x1088"/>
        <edc:DCRDef ltx:memberofperipheral="SIGROW" edc:cname="SERNUM0" edc:nzwidth="0x8" edc:impl="0x0" edc:unused="0x0" edc:useinchecksum="0xFF" edc:factorydefault="0x0" edc:access="rrrrrrrr" edc:_addr="0x1090"/>
        <edc:DCRDef ltx:memberofperipheral="SIGROW" edc:cname="SERNUM1" edc:nzwidth="0x8" edc:impl="0x0" edc:unused="0x0" edc:useinchecksum="0xFF" edc:factorydefault="0x0" edc:access="rrrrrrrr" edc:_addr="0x1091"/>
        <edc:DCRDef ltx:memberofperipheral="SIGROW" edc:cname="SERNUM2" edc:nzwidth="0x8" edc:impl="0x0" edc:unused="0x0" edc:useinchecksum="0xFF" edc:factorydefault="0x0" edc:access="rrrrrrrr" edc:_addr="0x1092"/>
        <edc:DCRDef ltx:memberofperipheral="SIGROW" edc:cname="SERNUM3" edc:nzwidth="0x8" edc:impl="0x0" edc:unused="0x0" edc:useinchecksum="0xFF" edc:factorydefault="0x0" edc:access="rrrrrrrr" edc:_addr="0x1093"/>
        <edc:DCRDef ltx:memberofperipheral="SIGROW" edc:cname="SERNUM4" edc:nzwidth="0x8" edc:impl="0x0" edc:unused="0x0" edc:useinchecksum="0xFF" edc:factorydefault="0x0" edc:access="rrrrrrrr" edc:_addr="0x1094"/>
        <edc:DCRDef ltx:memberofperipheral="SIGROW" edc:cname="SERNUM5" edc:nzwidth="0x8" edc:impl="0x0" edc:unused="0x0" edc:useinchecksum="0xFF" edc:factorydefault="0x0" edc:access="rrrrrrrr" edc:_addr="0x1095"/>
        <edc:DCRDef ltx:memberofperipheral="SIGROW" edc:cname="SERNUM6" edc:nzwidth="0x8" edc:impl="0x0" edc:unused="0x0" edc:useinchecksum="0xFF" edc:factorydefault="0x0" edc:access="rrrrrrrr" edc:_addr="0x1096"/>
        <edc:DCRDef ltx:memberofperipheral="SIGROW" edc:cname="SERNUM7" edc:nzwidth="0x8" edc:impl="0x0" edc:unused="0x0" edc:useinchecksum="0xFF" edc:factorydefault="0x0" edc:access="rrrrrrrr" edc:_addr="0x1097"/>
        <edc:DCRDef ltx:memberofperipheral="SIGROW" edc:cname="SERNUM8" edc:nzwidth="0x8" edc:impl="0x0" edc:unused="0x0" edc:useinchecksum="0xFF" edc:factorydefault="0x0" edc:access="rrrrrrrr" edc:_addr="0x1098"/>
        <edc:DCRDef ltx:memberofperipheral="SIGROW" edc:cname="SERNUM9" edc:nzwidth="0x8" edc:impl="0x0" edc:unused="0x0" edc:useinchecksum="0xFF" edc:factorydefault="0x0" edc:access="rrrrrrrr" edc:_addr="0x1099"/>
        <edc:DCRDef ltx:memberofperipheral="SIGROW" edc:cname="SERNUM10" edc:nzwidth="0x8" edc:impl="0x0" edc:unused="0x0" edc:useinchecksum="0xFF" edc:factorydefault="0x0" edc:access="rrrrrrrr" edc:_addr="0x109A"/>
        <edc:DCRDef ltx:memberofperipheral="SIGROW" edc:cname="SERNUM11" edc:nzwidth="0x8" edc:impl="0x0" edc:unused="0x0" edc:useinchecksum="0xFF" edc:factorydefault="0x0" edc:access="rrrrrrrr" edc:_addr="0x109B"/>
        <edc:DCRDef ltx:memberofperipheral="SIGROW" edc:cname="SERNUM12" edc:nzwidth="0x8" edc:impl="0x0" edc:unused="0x0" edc:useinchecksum="0xFF" edc:factorydefault="0x0" edc:access="rrrrrrrr" edc:_addr="0x109C"/>
        <edc:DCRDef ltx:memberofperipheral="SIGROW" edc:cname="SERNUM13" edc:nzwidth="0x8" edc:impl="0x0" edc:unused="0x0" edc:useinchecksum="0xFF" edc:factorydefault="0x0" edc:access="rrrrrrrr" edc:_addr="0x109D"/>
        <edc:DCRDef ltx:memberofperipheral="SIGROW" edc:cname="SERNUM14" edc:nzwidth="0x8" edc:impl="0x0" edc:unused="0x0" edc:useinchecksum="0xFF" edc:factorydefault="0x0" edc:access="rrrrrrrr" edc:_addr="0x109E"/>
        <edc:DCRDef ltx:memberofperipheral="SIGROW" edc:cname="SERNUM15" edc:nzwidth="0x8" edc:impl="0x0" edc:unused="0x0" edc:useinchecksum="0xFF" edc:factorydefault="0x0" edc:access="rrrrrrrr" edc:_addr="0x109F"/>
      </edc:DeviceIDSector>
      <edc:UserIDSector edc:regionid="BOOTROW" edc:beginaddr="0x1100" edc:endaddr="0x1200" edc:magicoffset="0x860000" atdf:pagesize="0x100" edc:rw="rw">
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW0" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1100"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW1" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1101"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW2" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1102"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW3" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1103"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW4" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1104"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW5" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1105"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW6" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1106"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW7" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1107"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW8" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1108"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW9" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1109"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW10" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x110A"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW11" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x110B"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW12" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x110C"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW13" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x110D"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW14" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x110E"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW15" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x110F"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW16" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1110"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW17" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1111"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW18" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1112"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW19" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1113"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW20" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1114"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW21" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1115"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW22" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1116"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW23" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1117"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW24" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1118"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW25" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1119"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW26" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x111A"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW27" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x111B"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW28" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x111C"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW29" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x111D"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW30" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x111E"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW31" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x111F"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW32" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1120"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW33" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1121"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW34" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1122"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW35" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1123"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW36" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1124"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW37" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1125"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW38" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1126"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW39" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1127"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW40" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1128"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW41" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1129"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW42" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x112A"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW43" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x112B"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW44" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x112C"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW45" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x112D"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW46" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x112E"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW47" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x112F"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW48" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1130"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW49" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1131"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW50" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1132"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW51" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1133"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW52" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1134"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW53" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1135"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW54" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1136"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW55" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1137"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW56" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1138"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW57" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1139"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW58" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x113A"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW59" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x113B"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW60" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x113C"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW61" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x113D"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW62" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x113E"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW63" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x113F"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW64" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1140"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW65" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1141"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW66" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1142"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW67" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1143"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW68" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1144"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW69" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1145"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW70" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1146"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW71" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1147"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW72" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1148"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW73" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1149"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW74" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x114A"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW75" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x114B"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW76" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x114C"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW77" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x114D"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW78" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x114E"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW79" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x114F"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW80" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1150"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW81" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1151"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW82" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1152"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW83" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1153"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW84" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1154"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW85" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1155"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW86" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1156"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW87" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1157"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW88" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1158"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW89" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1159"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW90" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x115A"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW91" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x115B"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW92" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x115C"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW93" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x115D"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW94" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x115E"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW95" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x115F"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW96" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1160"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW97" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1161"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW98" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1162"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW99" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1163"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW100" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1164"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW101" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1165"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW102" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1166"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW103" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1167"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW104" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1168"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW105" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1169"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW106" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x116A"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW107" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x116B"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW108" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x116C"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW109" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x116D"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW110" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x116E"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW111" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x116F"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW112" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1170"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW113" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1171"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW114" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1172"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW115" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1173"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW116" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1174"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW117" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1175"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW118" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1176"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW119" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1177"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW120" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1178"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW121" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1179"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW122" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x117A"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW123" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x117B"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW124" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x117C"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW125" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x117D"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW126" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x117E"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW127" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x117F"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW128" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1180"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW129" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1181"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW130" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1182"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW131" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1183"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW132" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1184"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW133" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1185"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW134" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1186"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW135" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1187"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW136" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1188"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW137" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1189"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW138" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x118A"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW139" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x118B"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW140" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x118C"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW141" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x118D"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW142" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x118E"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW143" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x118F"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW144" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1190"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW145" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1191"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW146" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1192"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW147" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1193"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW148" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1194"/>
